Autodesk.Revit.DB.Visual.MasonryCMU.CommonTintColor
The property labeled "Tint Color" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.CommonTintToggle
The property labeled "Tint" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPatternHeight
The property labeled "Amount" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPatternMap
The property labeled "Image" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPattern
The property labeled "Relief Pattern" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUApplication
The property labeled "Finish" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUApplicationType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUColorByObject
The property labeled "Color By Object" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUColor
The property labeled "Color" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUType
The property labeled "Type" from the "MasonryCMU" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MasonryCMU
Represents the properties of materials.
Since:
2018.1